## 데이터 프레임

In [1]:
import pandas as pd

df = pd.DataFrame({'name': ['김지훈', '이유진', '박동현', '김민지'],
                    'english': [90, 80, 60, 70],
                    'math': [50, 60, 100, 20]})

df

  name  english  math
0  김지훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [2]:
df.to_csv('df.csv', index=False)

In [3]:
df['english']

0    90
1    80
2    60
3    70
Name: english, dtype: int64

In [4]:
sum(df['english'])

300

In [5]:
sum(df['math'])

230

In [6]:
sum(df['english']) / 4

75.0

In [7]:
sum(df['math']) / 4

57.5

In [8]:
sales = pd.DataFrame({'fruit' : ['사과', '딸기', '수박'],
                      'price': [1800, 1500, 3000],
                      'volume': [24, 38, 13]})

sales

  fruit  price  volume
0    사과   1800      24
1    딸기   1500      38
2    수박   3000      13

In [9]:
sum(sales['price']) / 3

2100.0

In [10]:
sum(sales['volume']) / 3

25.0

## 외부 데이터 이용하기

In [14]:
!pip install openpyxl

Collecting openpyxl
  Using cached openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Using cached et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Using cached openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Using cached et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

In [15]:
df_exam = pd.read_excel('../data/excel_exam.xlsx')
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [16]:
sum(df_exam['english']) / 20

84.9

In [17]:
sum(df_exam['science']) / 20

59.45

In [18]:
x = [1, 2, 3, 4, 5]
x

[1, 2, 3, 4, 5]

In [19]:
len(x)

5

In [22]:
df = pd.DataFrame({'a':[1,2,3,4,5],
                   'b':[4,5,6,7,8]})
df

   a  b
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [23]:
len(df)

5

In [24]:
sum(df_exam['english']) / len(df_exam)

84.9

In [25]:
sum(df_exam['science']) / len(df_exam)

59.45

In [28]:
df_examl_novar = pd.read_excel('../data/excel_exam_novar.xlsx', header=None)
df_examl_novar

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15
5  6  3  50  98  45
6  7  4  46  98  65
7  8  4  48  87  12

In [29]:
df_exam1 = pd.read_excel('../data/excel_exam.xlsx', sheet_name='Sheet1')
df_exam1

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [32]:
df_exam2 = pd.read_excel('../data/excel_exam.xlsx', sheet_name='Sheet2', header=None)
df_exam2

   0  1   2   3          4
0  1  1  50  98  50_x000d_
1  2  1  60  97  60_x000d_
2  3  2  25  80  65_x000d_
3  4  2  50  89  98_x000d_
4  5  3  20  98  15_x000d_
5  6  3  50  98  45_x000d_
6  7  4  46  98  65_x000d_
7  8  4  48  87         12

In [36]:
df_exam2 = pd.read_excel('../data/excel_exam.xlsx', sheet_name=1, header=None)
df_exam2

   0  1   2   3          4
0  1  1  50  98  50_x000d_
1  2  1  60  97  60_x000d_
2  3  2  25  80  65_x000d_
3  4  2  50  89  98_x000d_
4  5  3  20  98  15_x000d_
5  6  3  50  98  45_x000d_
6  7  4  46  98  65_x000d_
7  8  4  48  87         12

In [37]:
df_csv_examl = pd.read_csv('../data/exam.csv')
df_csv_examl

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [38]:
df_midterm = pd.DataFrame({'english':[90, 80, 60, 70],
                           'math':[50, 60, 100, 20],
                           'nclass':[1, 1, 2, 2]})
df_midterm

   english  math  nclass
0       90    50       1
1       80    60       1
2       60   100       2
3       70    20       2

In [39]:
df_midterm.to_csv('output_newdata.csv')

In [40]:
df_midterm.to_csv('output_newdata.csv', index=False)